arduino/portentax8-stm32h7-fw/CM7/Core/Src/main.c
  if (huart2.Init.BaudRate == baud &&
      huart2.Init.WordLength == WordLength &&
      huart2.Init.StopBits == StopBits &&
      huart2.Init.Parity == Parity &&
      huart2.Init.HwFlowCtl == HwFlowCtl) {
      return;
  }

  huart2.Init.BaudRate = baud;
  huart2.Init.WordLength = WordLength;
  huart2.Init.StopBits = StopBits;
  huart2.Init.Parity = Parity;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = HwFlowCtl;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart2.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

  dbg_printf("Reconfiguring UART with %d baud, %d%c%d , %s flow control\n",
    baud, bits, parity_str, stop_bits, flow_control ? "" : "no");

  HAL_UART_DeInit(&huart2);

  if (HAL_UART_Init(&huart2) != HAL_OK) {
    Error_Handler();
  }

  UART2_enable_rx_irq();
}

/*
volatile bool can1_rx_irq = false;
volatile bool can2_rx_irq = false;

void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs) {
  if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) != RESET) {
    if (hfdcan == &hfdcan1) {
      can1_rx_irq = true;
    }
    if (hfdcan == &hfdcan2) {
      can2_rx_irq = true;
    }
  }
}
*/

can_t fdcan_1;
can_t fdcan_2;

void configureFDCAN(uint8_t peripheral, void* data) {

  if (peripheral == PERIPH_FDCAN1) {
    can_frequency(&fdcan_1, *((uint32_t*)data));
  } else {
    can_frequency(&fdcan_2, *((uint32_t*)data));
  }

  dbg_printf("Configuring fdcan%d with frequency %d\n", peripheral == PERIPH_FDCAN1 ? 1 : 2, *((uint32_t*)data));

  //HAL_FDCAN_ConfigFilter(&_hfdcan1, filterDef);
  //HAL_FDCAN_ConfigGlobalFilter(&_hfdcan1, nonMatchingStd, nonMatchingExt, rejectRemoteStd, rejectRemoteExt);
}

int _read(int file, char *ptr, int len) {

}

int _write(int file, char *ptr, int len) {
  HAL_UART_Transmit(&huart2, ptr, len, 100);
  return len;
}

ring_buffer_t uart_ring_buffer;
ring_buffer_t virtual_uart_ring_buffer;

static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Do MPU */
  HAL_MPU_Disable();

  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = (uint32_t)TX_Buffer;
  MPU_InitStruct.Size = MPU_REGION_SIZE_2KB;    
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = (uint32_t)RX_Buffer;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = (uint32_t)RX_Buffer_userspace;
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  MPU_InitStruct.BaseAddress = D3_SRAM_BASE;
  MPU_InitStruct.Size = MPU_REGION_SIZE_64KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

static FLASH_OBProgramInitTypeDef OBInit;

void disableCM4Autoboot() {
  OBInit.Banks     = FLASH_BANK_1;
  HAL_FLASHEx_OBGetConfig(&OBInit);
  dbg_printf("OBInit.USERConfig: %X\n", OBInit.USERConfig);
  if (OBInit.USERConfig & FLASH_OPTSR_BCM4) {
    dbg_printf("Changing option bytes\n");
    OBInit.OptionType = OPTIONBYTE_USER;
    OBInit.USERType = OB_USER_BCM4;
    OBInit.USERConfig = 0;
    if (HAL_FLASH_OB_Unlock() == HAL_OK)
      if (HAL_FLASH_Unlock() == HAL_OK)
        if (HAL_FLASHEx_OBProgram(&OBInit) == HAL_OK)
          if (HAL_FLASH_OB_Launch() == HAL_OK)
            if (HAL_FLASH_OB_Lock() == HAL_OK)
              if (HAL_FLASH_Lock() == HAL_OK)
              {
                dbg_printf("Option bytes changed\n");
                dbg_printf("Requires rebooting\n");
                NVIC_SystemReset();
                return;
              }
    dbg_printf("Failed changing option bytes");
  }
}


int main(void) {

  MPU_Config();

  SCB_EnableICache();
  SCB_EnableDCache();

  HAL_Init();

  SystemClock_Config();

  MX_USART2_UART_Init();

  PeriphCommonClock_Config();

  ring_buffer_init(&uart_ring_buffer);
  ring_buffer_init(&virtual_uart_ring_buffer);

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  //MX_FDCAN1_Init();
  //MX_FDCAN2_Init();
  MX_DMA_Init();
  MX_HRTIM_Init();
  MX_RTC_Init();
  MX_SPI3_Init();

  //Initialize and start the ADCs
  adc_init();

#ifdef PORTENTA_DEBUG_WIRED
  // Enable SPI2 (Portenta only)
  MX_SPI2_Init();
#endif

  can_init_freq_direct(&fdcan_1, CAN_1, 800000);
  can_init_freq_direct(&fdcan_2, CAN_2, 800000);

  disableCM4Autoboot();

/*
  HAL_FDCAN_Start(&hfdcan1);
  HAL_FDCAN_Start(&hfdcan2);

  HAL_FDCAN_ActivateNotification(&hfdcan1, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
  HAL_FDCAN_ActivateNotification(&hfdcan2, FDCAN_IT_RX_FIFO0_NEW_MESSAGE, 0);
*/

  memset((uint8_t*)TX_Buffer, 0, sizeof(TX_Buffer));
  memset((uint8_t*)RX_Buffer, 0, sizeof(RX_Buffer));

  struct complete_packet *tx_pkt = (struct complete_packet *)TX_Buffer;

  GPIO_InitTypeDef GPIO_InitStruct = {0};

  // IRQ PIN from H7 to M8
  // TODO: changeme when final HW is ready

  __HAL_RCC_GPIOA_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 1);

#ifndef PORTENTA_DEBUG_WIRED

  __HAL_RCC_GPIOA_CLK_ENABLE();

  // Interrupt on CS LOW
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

