arduino/portentax8-stm32h7-fw/CM7/Core/Src/main.c
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

#else

  // Enable LEDs (Portenta only)
  __HAL_RCC_GPIOK_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOK, &GPIO_InitStruct);

  // Interrupt on CS LOW
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  HAL_NVIC_SetPriority(EXTI0_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);
#endif

  // Start DMA on SPI
  //HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)TX_Buffer,
  //                            (uint8_t *)RX_Buffer, sizeof(uint16_t) * 2);

  printf("Portenta X8 - STM32H7 companion fw - %s %s\n", __DATE__, __TIME__);

  int m4_app_valid = (((*(__IO uint32_t *) FLASH_BANK2_BASE) & 0xFF000000) == 0x10000000);

  if (m4_app_valid) {
    printf("Boot CM4\n");
    LL_RCC_ForceCM4Boot();
    int ret = serial_rpc_begin();
    printf("CM4 booted: %d\n", ret);
  }

  watchdog.Instance = IWDG1;
  watchdog.Init.Prescaler = IWDG_PRESCALER_16;
  watchdog.Init.Reload = (32000 * 2000) / (16 * 1000); /* 2000 ms */
  watchdog.Init.Window = (32000 * 2000) / (16 * 1000); /* 2000 ms */

  HAL_IWDG_Init(&watchdog);

#ifdef PORTENTA_DEBUG_WIRED
  HAL_GPIO_WritePin(GPIOK, GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7, 1);
#endif

  while (1) {

    __WFI();

    //serial_rpc_available();
    HAL_IWDG_Refresh(&watchdog);

    if (!ring_buffer_is_empty(&uart_ring_buffer)) {
        uint8_t temp_buf[1024];
        __disable_irq();
        int cnt = ring_buffer_dequeue_arr(&uart_ring_buffer, temp_buf, ring_buffer_num_items(&uart_ring_buffer));
				__enable_irq();
        enqueue_packet(PERIPH_UART, DATA, cnt, temp_buf);
    }

    if (!ring_buffer_is_empty(&virtual_uart_ring_buffer)) {
    		printf("ring_buffer_num_items: %d\n", ring_buffer_num_items(&virtual_uart_ring_buffer));
        uint8_t temp_buf[1024];
        __disable_irq();
        int cnt = ring_buffer_dequeue_arr(&virtual_uart_ring_buffer, temp_buf, ring_buffer_num_items(&virtual_uart_ring_buffer));
        __enable_irq();
        enqueue_packet(PERIPH_VIRTUAL_UART, DATA, cnt, temp_buf);
    }

    CAN_Message msg;
    if (can_read(&fdcan_1, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN1, DATA, sizeof(msg), &msg);
    }

    if (can_read(&fdcan_2, &msg, 0)) {
      enqueue_packet(PERIPH_FDCAN2, DATA, sizeof(msg), &msg);
    }

    if (transferState == TRANSFER_COMPLETE) {

#ifdef PORTENTA_DEBUG_WIRED
      HAL_GPIO_WritePin(GPIOK, GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7, 1);
#endif

      struct subpacket *rx_pkt_userspace =
          (struct subpacket *)RX_Buffer_userspace;

      while (rx_pkt_userspace->peripheral != 0xFF &&
             rx_pkt_userspace->peripheral != 0x00) {
        dbg_printf("Peripheral: %s Opcode: %X Size: %X\n  data: ",
        		to_peripheral_string(rx_pkt_userspace->peripheral), rx_pkt_userspace->opcode,
                rx_pkt_userspace->size);
        for (int i = 0; i < rx_pkt_userspace->size; i++) {
          dbg_printf("0x%02X ", *((&rx_pkt_userspace->raw_data) + i));
        }
        dbg_printf("\n");

        // do something useful with this packet
        dispatchPacket(rx_pkt_userspace->peripheral, rx_pkt_userspace->opcode,
        		rx_pkt_userspace->size, &(rx_pkt_userspace->raw_data));

        rx_pkt_userspace = (struct subpacket *)((uint8_t *)rx_pkt_userspace + 4 + rx_pkt_userspace->size);
      }
      transferState = TRANSFER_WAIT;
    }

    if (transferState == TRANSFER_ERROR) {
        dbg_printf("got transfer error, recovering\n");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 0);
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 1);
        transferState = TRANSFER_WAIT;
    }

/*
    if (trigger_irq) {
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 0);
      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, 1);
      trigger_irq = false;
    }
*/
  }
}

#ifdef PORTENTA_DEBUG_WIRED
void EXTI0_IRQHandler(void)
{
	if (get_data_amount) {
		HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t *)TX_Buffer,
		                                (uint8_t *)RX_Buffer, sizeof(uint16_t) * 2);
	}
	HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
}
#endif

void EXTI15_10_IRQHandler(void)
{
  if (get_data_amount) {
    HAL_SPI_TransmitReceive_DMA(&hspi3, (uint8_t *)TX_Buffer,
                                    (uint8_t *)RX_Buffer, sizeof(uint16_t) * 2);
  }
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
}

void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi) {

  struct complete_packet *rx_pkt = (struct complete_packet *)RX_Buffer;
  struct complete_packet *tx_pkt = (struct complete_packet *)TX_Buffer;

  if (get_data_amount) {

#ifdef PORTENTA_DEBUG_WIRED
    HAL_GPIO_WritePin(GPIOK, GPIO_PIN_5, 0);
#endif

    data_amount = max(tx_pkt->size, rx_pkt->size);

    if (data_amount == 0) {
      return;
    }

    // reconfigure the DMA to actually receive the data
#ifndef PORTENTA_DEBUG_WIRED
    HAL_SPI_TransmitReceive_DMA(&hspi3, (uint8_t*)&(tx_pkt->data), (uint8_t*)&(rx_pkt->data), data_amount);
#else
    HAL_SPI_TransmitReceive_DMA(&hspi2, (uint8_t*)&(tx_pkt->data), (uint8_t*)&(rx_pkt->data), data_amount);
#endif
    get_data_amount = false;

  } else {
    // real end of operation, pause DMA, memcpy stuff around and reenable DMA
    // HAL_SPI_DMAPause(&hspi1);

    transferState = TRANSFER_COMPLETE;

    memcpy((void *)RX_Buffer_userspace, &(rx_pkt->data), rx_pkt->size);

    // mark the next packet as invalid
    *((uint32_t*)((uint8_t *)RX_Buffer_userspace + rx_pkt->size)) = 0xFFFFFFFF; // INVALID;

    // clean the transfer buffer size to restart
    tx_pkt->size = 0;

#ifdef PORTENTA_DEBUG_WIRED
    HAL_GPIO_WritePin(GPIOK, GPIO_PIN_6, 0);
#endif

    get_data_amount = true;

    // HAL_SPI_DMAResume(&hspi1);
  }
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi) {
  transferState = TRANSFER_ERROR;

#ifndef PORTENTA_DEBUG_WIRED
  HAL_SPI_Abort(&hspi3);
#else
  HAL_SPI_Abort(&hspi2);
#endif

